v2206/MSc_icedAirfoil/smooth/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     pimpleFoam;

startFrom       startTime;

startTime       0;

stopAt          endTime;

endTime         2;
deltaT          5e-4;

writeControl    adjustable;

writeInterval   0.2;

purgeWrite      0;

writeFormat     ascii;

writePrecision  10;

writeCompression off;

timeFormat      general;

timePrecision   6;

runTimeModifiable true;

adjustTimeStep  yes;

maxCo           0.8;

functions
{

    forceCoeffs
    {
        type                forceCoeffs;
        functionObjectLibs  ("libforces.so");
        writeControl	    runTime;
        writeInterval	    $writeInterval;

    
        patches             ("airfoil");
        rho			        rhoInf;
        log                 true;
        
        liftDir             (0 1 0);
        dragDir             (1 0 0);
        pitchAxis           (0 0 1);	//specify axis
        CofR                (0.25 0 0);	//specify axis
        
        magUInf             15;
        rhoInf              1.2;

        lRef                1.0;
        Aref                1.0e-4;
    }

    yPlus
    {
        type        	    yPlus;
        writeControl	    runTime;
        writeInterval	    $writeInterval;

        libs        	    ("libfieldFunctionObjects.so");
    }

}

// ************************************************************************* //
