v2206/MSc_icedAirfoil/smooth/system/benchmarkGeometry_0/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

// convertToMeters 1;
scale   1;

vertices
(
	(-1.2  -1.0   -0.01)	// vertex 0
	(-1.2	1.0   -0.01)	// vertex 1
	( 3.0  -1.0   -0.01)	// vertex 2
	( 3.0   1.0   -0.01)	// vertex 3
	(-1.2  -1.0    0.01)	// vertex 4
	(-1.2	1.0    0.01)	// vertex 5
	( 3.0  -1.0    0.01)	// vertex 6
	( 3.0   1.0    0.01)	// vertex 7
);


blocks
(
    hex (0 2 3 1 4 6 7 5)
    (32 24 1)
    simpleGrading (1 1 1)
);


edges
(
);

boundary
(
    west
    {
        type patch;
        faces
        (
		    (0 1 5 4)
        );
    }
    east
    {
        type patch;
        faces
        (
		    (2 6 7 3)
        );
    }
    north
    {
        type patch;
        faces
        (
		    (1 3 7 5)
	    );
    }
    south
    {
        type patch;
        faces
        (
		    (0 4 6 2)
        );
    }
    front
    {
        type symmetryPlane;
        faces
        (
		    (4 6 7 5)
        );
    }
    back
    {
        type symmetryPlane;
        faces
        (
		    (0 2 3 1)
        );
    }
);



// scale   1;

// vertices
// (
//     (-0.5 -0.5 -0.1) // vertex 0
//     ( 2.0 -0.5 -0.1) // vertex 1
//     ( 2.0  0.5 -0.1) // vertex 2
//     (-0.5  0.5 -0.1) // vertex 3
//     (-0.5 -0.5  0.1) // vertex 4
//     ( 2.0 -0.5  0.1) // vertex 5
//     ( 2.0  0.5  0.1) // vertex 6
//     (-0.5  0.5  0.1) // vertex 7
// );

// blocks
// (
//     hex (0 1 2 3 4 5 6 7) (12 7 1) simpleGrading (1 1 1)
// );

// edges
// (
// );

// boundary
// (
//     west
//     {
//         type patch;
//         faces
//         (
//             (0 4 7 3)
//         );
//     }
//     east
//     {
//         type patch;
//         faces
//         (
//             (2 6 5 1)
//         );
//     }
//     north
//     {
//         type patch;
//         faces
//         (
//             (3 7 6 2)
// 	    );
//     }
//     south
//     {
//         type patch;
//         faces
//         (
//             (1 5 4 0)
//         );
//     }
//     front
//     {
//         type symmetryPlane;
//         faces
//         (
//             (4 5 6 7)
//         );
//     }
//     back
//     {
//         type symmetryPlane;
//         faces
//         (
//             (0 3 2 1)
//         );
//     }
// );





// ************************************************************************* //
