v2206/MSc_icedAirfoil/smooth/0.orig/omega
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      omega;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 -1 0 0 0 0];

// internalField   uniform     102.6082;

// internalField   uniform     13.6332;
// internalField   uniform     4.0249;
// internalField   uniform     3.3541;
// internalField   uniform     2.6833;
internalField   uniform     2.3958; // 1.67705;

boundaryField
{
    airfoil
    {
        type            omegaWallFunction;
        value           uniform 3125.0;
    }
    west
    {
        type            fixedValue;
        value           $internalField;
    }
    east
    {
	    type            inletOutlet;
        inletValue      $internalField;
        value           $internalField;
    }
    north
    {
	    type            slip;
    }
    south
    {
	    type            slip;
    }
    front
    {
        type            empty;
    }
    back
    {
        type            empty;
    }
}
// ************************************************************************* //
