v2206/MSc_icedAirfoil/smooth/system/surfaceFeatureExtractDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      surfaceFeaturesExtractDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

smoothAirfoil_1.obj 
{ 
    extractionMethod            extractFromSurface;
    extractFromSurfaceCoeffs    { includedAngle 135; }

    subsetFeatures
    {
        nonManifoldEdges        no;
        openEdges               no;
    }
}


// ************************************************************************* //
